{"data":[{"title":"404 Not Found!","url":"/404.html","content":" -->\n\nМатериал не найден!\n"},{"title":"Обратная связь","url":"/obratnaya-svaz/","content":"Связь со мной\n\n\nОбратная связь\n\nwindow.onload = function() {\n    var iframe = document.createElement('iframe');\n    //iframe.style.display = \"none\";\n    iframe.src = 'https://docs.google.com/forms/d/e/1FAIpQLSc8Y-8rcqKu62u2sFj4rUVwqlf7sk5UwHtjcZGIDw3ALWtE1A/viewform?embedded=true';\n    //iframe.width = 640;\n    //iframe.height = 705;\n    iframe.frameborder = 0;\n    iframe.marginheight = 0;\n    iframe.marginwidth = 0;\n    iframe.scrolling = 'no';\n    iframe.style.width = '100%';\n    iframe.style.border = 'none';\n    iframe.height = 800;\n\n    document.getElementById('contact-form').appendChild(iframe);\n};\n\n\n\n\n"},{"title":"Работы (портфолио)","url":"/portfolio/","content":"Моё портфолио.\n\n\nПростые сайты\nСайты-визитки и корпоративные блоги\nИнтернет-магазины (CMS Opencart и моды)\nИнтернет-магазины на базе CMS Opencart и OCStore 3.x\nЛендинги (Tilda &amp; inSales)\nЧат-боты (Telegram &amp; WhatsApp)\nРазное\n"},{"title":"Работы (портфолио)","url":"/portfolio/index.md1","content":"\nSome content...\n\n\n\n# This is my first post!"},{"title":"Скачать mp3 или видео с YouTube. Бесплатный API виджет","url":"/zametki/api-widget-skachat-mp3-mp4-iz-youtube/","content":"Бесплатный виджет (API) для разработчиков. Скачивание музыки и видео из YouTube в один клик\n\n\nИногда бывает что нужно скачать какой-то ролик из YouTube, но нет времени или желания запускать сторонний софт или тот-же YouTube-dl и не хочется тратить время на поиски сторонних сервисов неизвестного качества. Хочется чтобы нажал и готово!\nИменно эту задачу решает виджет от сервиса yt-download.org. Вы можете просто зайти на сервис, ввести ссылку на видео и получить варианты скачивания в mp3 или mp4 формате.\nА при чём тут разработчики, можете сказать вы. Сервис дает возможность разместить свои кнопки для скачивания видео где угодно с помощью обычного iframe. Таким образом, вы можете создать свой сервис для скачивания видео из ютуба и его монетизировать или же просто добавить новый функционал на свой сайт или расширение. Есть два формата виджетов, полный - показывает превью видео, длительность, название и кнопки для скачивания, минимальный - показывает только кнопки с размером и битрейтом видео или mp3 файла. И всё это работает без длительных ожиданий и долгой кновертации. Подборка музыки длиной в 1 час конвертировалась всего около 1 минуты.\nРеальные кейсы использования API\nКейс 1\nВы хотите создать свой сервис по скачиванию видео и музыки с YouTube. Создаёте простой сайт, да хоть на WordPress и встраиваете маленький iframe, передавая ID видео из ютуба, добавляете любимубю партнерку с рекламой и пушами, всё.\n``html\n\n``;\n\nКак это выглядит:\n\n\nКейс 2\nВы хотите создать своё расширние для добавления кнопок скачиваия видео и музыки с ютуба. К сожалению, но гугл запретил расширениям вмешиваться в работу сервисов гугла, таки дела. Но если сильно хочется, можно попробовать создать расширение с определением погоды по коту а после прохождения проверки, добавить новый функционал в своё расширение. Но это не точно.\nКейс 3 (не кейс)\nВы просто хотите удобно скачивать видео и музыку с ютуба, не скачивая ничего лишнего и без сторонних сервисов. В таком случае, можете просто скачать мой юзерскрипт для ютуба - https://pcmyonelove.github.io/yt-mp3-and-mp4.user.js и пользоваться :) После этого у вас появятся две новые кнопки (а может и три) над комментариями с желанными фичами.\nДокументация\nТолько кнопки\nURL для встраивания: https://www.yt-download.org/api/button/{ftype}/{YouTube video ID}\n\nftype:\nmp3 = MP3\nvideos = MP4\nmerged = WEBM / MKV\n\nПример IFrame:\n``html\n\n``;\n\nВиджет\nURL для встраивания: https://www.yt-download.org/api/widget/{ftype}/{YouTube video ID}\n\nftype:\nmp3 = MP3\nvideos = MP4\nmerged = WEBM / MKV\n\nПример IFrame:\n``html\n\n``;\n\nTODO: Добавить приятный бонус по кастомизации кнопок для читателей блога ;)\n"},{"title":"Первая запись","url":"/zametki/pervaya-zapis/","content":"Это первая запись в моём блоге. В ней я постараюсь выразить смысл существования этого блога и некоторые планы по его развитию.\n\n\nВ первую очередь, здесь время от времени будут появляться мои заметки, как правило, это рабочие решения различных задач, некоторые из которых даются весьма непросто. Чуть левее от заметок, вы можете найти моё портфолио, там будут собраны некоторые работы, которые я сделал либо доработал. Иногда будут появляться важные фичи из мира современного веба и сайтостроительства. Приправлено всё будет рабочими, на момент публикации, рецептами по внутренней SEO оптимизации готового сайта.\nБуду рад видеть вас среди читателей моего блога! Спасибо за внимание~\n"}]}